# Swiss Einzahlungsschein MIT Referenznummers

## Introduction

The function `clean_ch_esr()` cleans a column containing Swiss EinzahlungsSchein mit Referenznummer (ESR) strings, and standardizes them in a given format. The function `validate_ch_esr()` validates either a single ESR strings, a column of ESR strings or a DataFrame of ESR strings, returning `True` if the value is valid, and `False` otherwise.

ESR strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "1878583"
* `standard`: ESR strings with proper whitespace in the proper places, like "00 00000 00000 00000 00018 78583"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_ch_esr()` and `validate_ch_esr()`.

### An example dataset containing ESR strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "esr": [
            "18 78583",
            "210000000003139471430009016",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

,esr,address
0,18 78583,123 Pine Ave.
1,210000000003139471430009016,main st
2,51824753556,1234 west main heights 57033
3,51 824 753 556,apt 1 789 s maple rd manhattan
4,hello,"robie house, 789 north main street"
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles"
6,NULL,hello

## 1. Default `clean_ch_esr`

By default, `clean_ch_esr` will clean esr strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_ch_esr
clean_ch_esr(df, column = "esr")

,esr,address,esr_clean
0,18 78583,123 Pine Ave.,00 00000 00000 00000 00018 78583
1,210000000003139471430009016,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_ch_esr(df, column = "esr", output_format="standard")

,esr,address,esr_clean
0,18 78583,123 Pine Ave.,00 00000 00000 00000 00018 78583
1,210000000003139471430009016,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_ch_esr(df, column = "esr", output_format="compact")

,esr,address,esr_clean
0,18 78583,123 Pine Ave.,1878583
1,210000000003139471430009016,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned ESR strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_ch_esr(df, column="esr", inplace=True)

,esr_clean,address
0,00 00000 00000 00000 00018 78583,123 Pine Ave.
1,NaN,main st
2,NaN,1234 west main heights 57033
3,NaN,apt 1 789 s maple rd manhattan
4,NaN,"robie house, 789 north main street"
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles"
6,NaN,hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_ch_esr(df, "esr", errors="coerce")

,esr,address,esr_clean
0,18 78583,123 Pine Ave.,00 00000 00000 00000 00018 78583
1,210000000003139471430009016,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_ch_esr(df, "esr", errors="ignore")

,esr,address,esr_clean
0,18 78583,123 Pine Ave.,00 00000 00000 00000 00018 78583
1,210000000003139471430009016,main st,210000000003139471430009016
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_ch_esr()`

`validate_ch_esr()` returns `True` when the input is a valid ESR. Otherwise it returns `False`.

The input of `validate_ch_esr()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_ch_esr()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_ch_esr()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_ch_esr
print(validate_ch_esr("18 78583"))
print(validate_ch_esr("210000000003139471430009016"))
print(validate_ch_esr("51824753556"))
print(validate_ch_esr("51 824 753 556"))
print(validate_ch_esr("hello"))
print(validate_ch_esr(np.nan))
print(validate_ch_esr("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_ch_esr(df["esr"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: esr, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_ch_esr(df, column="esr")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: esr, dtype: bool

### Only DataFrame

In [11]:
validate_ch_esr(df)

     esr  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False